Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: དོན་འབྱུང་བ་སྟོན་པའི་ཚིག་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་སྐྱེ་བ་དང་། འགག་པ་མེད་པ་དང་། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པ་དང་། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཉེ་བར་ཞི་བ་དང་།
en: In the presence of that thus-gone one, he heard words of wisdom, words difficult to understand, words that reveal meaning. He learned that all phenomena are without arising and without ceasing, that all phenomena are unreal, that all phenomena are by nature at peace, and that all buddhas attain the same awakening.

source: སངས་རྒྱས་ཐམས་ཅད་སངས་རྒྱས་གཅིག་པ་ཞེས་བྱ་བ་དག་ཐོས་ནས་ཞག་བདུན་དུ་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་དང་། བརྩོན་པ་མི་གཏོང་བ་དང་། ཡིད་ལ་བྱེད་པ་གཞན་མེད་པར་ཚིག་བཞི་པོ་དེ་དག་ལུས་ལ་ཞེན་པ་དང་། ཤིན་ཏུ་བརྟན་པ་དང་། ཤིན་ཏུ་ཞག་པ་དང་།
en: After he heard this, for seven days, without any slackening of effort, he tirelessly thought of nothing else, and he physically inculcated those four statements, keeping them firm in his mind, considering them attentively, reciting them, and examining them well. Seeing their truth, he attained great realization.

source: ཁ་ཏོན་བྱང་བ་དང་། ཡིད་ཀྱིས་ལེགས་པར་བརྟགས་པ་དང་། མཐོང་བས་ཤིན་ཏུ་རྟོགས་པར་བྱས་ཏེ་གནས་སོ། །ཀུན་དགའ་བོ་དགེ་སློང་དེས་དོན་གྱི་ཚིག་བསྟན་པ་བཞི་པོ་དེ་དག་གིས་སངས་རྒྱས་བྱེ་བ་སྙེད་ཀྱིས་གསུངས་པའི་ཆོས་བསྟན་པ་རྣམས་ལ་རྗེས་སུ་ཞུགས་ཏེ།
en: “Ānanda, with these four meaningful statements, that monk engaged with the Dharma that has been taught by countless millions of buddhas.

source: བཟུང་ཞིང་རྟོགས་པར་བྱས་ནས་དེ་སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་འོངས་ཏེ་ཆོས་བསྟན་ཏོ། །
en: Once he had memorized and understood them, he felt great kindness toward beings, and traveling through villages, cities, market towns, and countryside, he eventually arrived at the king’s palace to teach the Dharma.

source: ཀུན་དགའ་བོ་དེའི་ཚེ་ཆོས་སྨྲ་བའི་དགེ་སློང་ཡེ་ཤེས་དགའ་བ་ཞེས་བྱ་བར་གྱུར་པ་དེས་ལས་དེའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ལུས་ལ་ཞེན་པ་དང་། མང་དུ་ཐོས་པས་ལོ་དྲུག་ཏུ་ལྷག་པའི་བསམ་པས་ཆོས་བསྟན་པས་ན་བསྐལ་པ་གྲངས་མེད་པ་ཚུན་ཆད་ནས་དེའི་སྤུའི་ཁུང་བུ་དག་ནས་དེ་ལྟ་བུའི་སྒྲ་དག་དང་ལྡན་པའི་རྫུ་འཕྲུལ་དེ་ཉམས་སུ་མྱོང་བར་གྱུར་ཅིང་དེའི་ལུས་ལས་ཀྱང་སྐྱེ་བོ་མང་པོའི་དོན་བྱེད་པའི་ཆོས་ཀྱི་སྒྲ་བཞི་པོ་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་སྒྲ་དང་། དངོས་པོ་མེད་པའི་སྒྲ་དང་། ཉེ་བར་ཞི་བའི་སྒྲ་དང་།
en: “Ānanda, at that time, the karma of the preacher-monk Delighting in Wisdom came to fruition, and because of his physical inculcation, extensive learning, and six years of sincerely teaching the Dharma, thereafter, and for countless eons up until now, sounds have been magically emitting from his pores, and the four Dharma words that resound from his body and bring benefit to many beings are these: ‘empty,’ ‘unreal,’ ‘peace,’ and ‘awakened.’

source: སངས་རྒྱས་ཞེས་བྱ་བའི་སྒྲ་དེ་དེ་དག་འབྱུང་བར་གྱུར་ཏེ། ཀུན་དགའ་བོ་དེའི་ཕྱིར་བསྐལ་པ་གྲངས་མེད་པ་ཚུན་ཆད་ནས་ཁྱེའུ་འདིའི་སྤུའི་ཁུང་བུ་དག་ནས་སྒྲ་བཞི་པོ་འདི་དག་འབྱུང་བར་གྱུར་ཏོ། །
en: Ānanda, this is why for countless eons until now these four Dharma words have come to emerge from this child’s pores.

source: ཀུན་དགའ་བོ་འཛམ་བུའི་གླིང་གི་མི་གང་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ཀྱི་མིང་ཐོས་པ་དེ་དག་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་ཅིང་ཤིན་ཏུ་ལེགས་པར་རྙེད་པ་ཡིན་ན། གང་དག་གིས་ཆོས་སྟོན་པ་ཐོས་པ་དག་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “Ānanda, those beings of Jambudvīpa who merely hear the name of the bodhisattva great being Without Reference will be very fortunate, immensely fortunate—not to mention those who hear his Dharma teachings.

source: ཀུན་དགའ་བོ་ལྷ་དང་མི་རྣམས་ཀྱི་སྐྱེས་པའམ། བུད་མེད་གང་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ཀྱི་མིང་ཐོས་ཤིང་ཐོས་ནས་ཀྱང་དད་པ་ཐོབ་པར་གྱུར་པ་དེ་དག་ཀྱང་ཐོས་མ་ཐག་ཏུ་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་ན། གང་དག་གིས་ཤའི་མིག་གིས་མངོན་སུམ་དུ་མཐོང་བ་དག་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Ānanda, those gods and humans, both male and female, who upon hearing the name of the bodhisattva great being Without Reference develop faith will, as soon as they hear it, gain inconceivably numerous good qualities—not to mention those who actually see him with their physical eyes.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ནི་བྱང་ཆུབ་སེམས་དཔའི་སའི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དག་ཐོབ་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because, Ānanda, the bodhisattva great being Without Reference has attained the boundless good qualities of the bodhisattva stages.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལ་བལྟ་བར་འདོད་པའི་ཕྱིར་འོངས་པ་ཡིན་གྱིས།
en: “Ānanda, the bodhisattva great being Without Reference has come here because he wishes to see me, the Thus-Gone One, passing into parinirvāṇa.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔ་གང་དུ་རིགས་ཀྱི་བུ་འདི་འདུག་པར་འགྱུར་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ཀྱི་སྟན་ཐིང་ཤིག་དང་།
en: So, Ānanda, set out a seat before the Thus-Gone One for the bodhisattva great being Without Reference to sit upon.

source: དེས་ཁྱོད་ལ་ཡུན་རིང་པོར་ཕན་པ་དང་བདེ་བ་དང་མངོན་པར་ཤེས་པ་མྱུར་བ་ཉིད་དུ་ཡང་འགྱུར་རོ། །
en: By doing so, you will experience benefit and happiness for a long time, and you will swiftly gain the higher perceptions.

source: ཀུན་དགའ་བོ་འདིའི་སྟན་བཏིང་བ་ལས་བྱུང་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཁྱོད་སྙོམས་པར་འཇུག་པ་ལ་བདེ་བར་གནས་ཤིང་སེམས་བསྐྱེད་པའི་སྐད་ཅིག་གཅིག་གིས་ཟང་ཟིང་མེད་པའི་ཆོས་འཕགས་པ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་ཡང་འགྱུར་རོ། །
en: Ānanda, as the karmic fruition of the act of setting out his seat, you will easily remain in absorption, and the instant you generate to the mind set on awakening, you will attain the realization of the noble state of arhatship, with the quality of being uninterested in material things.

source: ཀུན་དགའ་བོ་གལ་ཏེ་ཁྱོད་ཉན་ཐོས་ཀྱི་ས་ལ་ངེས་པར་ཞུགས་པར་མ་གྱུར་ན་ནི་ཁྱོད་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཏུ་གྱུར་པའི་དགེ་བའི་རྩ་བ་འདིས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་རྗེས་སུ་འཐོབ་པར་ཡང་ངས་ལུང་སྟོན་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ།
en: “Ānanda, if you were not settled with certainty at the level of a hearer, I would prophesy that you would also acquire the qualities of a buddha, based on the roots of virtue of the branches of unsurpassed, completely perfect awakening.

source: དྲི་ཟའམ། ལྷ་མ་ཡིན་ནམ།
en: Why?

source: ནམ་མཁའ་ལྡིང་ངམ། མི་འམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ། མིའམ་མི་མ་ཡིན་པ་གང་ཡིན་པའམ། སེམས་ཅན་གཞན་གང་ཡང་རུང་བ་དག་གིས་ཞི་བ་བཤད་པ་ལུང་བསྟན་པ་འདི་ཐོས་ནས་དད་པ་རབ་ཏུ་འཐོབ་པར་འགྱུར་བའི་ཕྱིར་རོ། །
en: Because, Ānanda, any monk or nun, any lay devotee, male or female, any god, nāga, yakṣa, gandharva, asura, garuḍa, kinnara, mahoraga, human, or nonhuman, or any other type of being who hears this prophetic teaching on peace will develop great faith.

source: ཀུན་དགའ་བོ་གང་དག་ཞི་བ་བཤད་པ་ལུང་བསྟན་པ་འདི་ཉན་པར་འདོད་པ་དག་གིས་དེ་བཞིན་གཤེགས་པའམ། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་གང་དུ་འདུག་ནས་ཞི་བ་བཤད་པ་ལུང་བསྟན་པ་འདི་འཆད་པར་འགྱུར་བའི་ཆོས་ཀྱི་སྟན་བཤམ་པར་བྱ་སྟེ།
en: “Ānanda, those who wish to hear this prophetic teaching on peace should arrange Dharma seats for thus-gone ones or their disciples, wherever they may be, to expound this teaching that explains peace.

source: ཀུན་དགའ་བོ་དེས་སྟན་བཤམས་མ་ཐག་ཏུ་སྟན་ཕུན་སུམ་ཚོགས་པ་བཅུ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: Ānanda, as soon as such a seat is set out for them, they will become those who assume the ten wondrous seats.

source: བཅུ་གང་ཞེ་ན། འཁོར་ལོས་སྒྱུར་བའི་སྟན་འཐོབ་པ་དང་། བརྒྱ་བྱིན་གྱི་སྟན་འཐོབ་པ་དང་། ཚངས་པའི་སྟན་འཐོབ་པ་དང་། སྐྱེ་དགུའི་བདག་པོའི་སྟན་འཐོབ་པ་དང་། ཚེ་རབས་དེ་དང་དེ་དག་ཏུ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་སྟན་འཐོབ་པ་དང་། དབང་བསྐུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་སོང་བའི་སེང་གེའི་ཁྲི་སྟན་འཐོབ་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྟོགས་པའི་སངས་རྒྱས་ཀྱི་ཁྲི་སྟན་བླ་ན་མེད་པ་འཐོབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་ན་ཆོས་ཀྱི་འཁོར་ལོ་བླ་ན་མེད་པ་སྐོར་བའི་ཁྲི་སྟན་འཐོབ་པ་དང་།
en: What are the ten?

source: དེ་བཞིན་གཤེགས་པའི་ཆོ་འཕྲུལ་ཆེན་པོ་ཀུན་ཏུ་སྟོན་པ་ན་ལྷ་བྱེ་བ་ཕྲག་སྟོང་གིས་འདུས་བྱས་པ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་ཤིང་ཟིལ་གྱིས་མི་ནོན་ལ། བླ་ན་མེད་པའི་རྫུ་འཕྲུལ་དང་ལྡན་པའི་སེང་གེའི་ཁྲི་སྟན་འཐོབ་པ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་དུས་ཀྱི་ཚེ་འདུ་བྱེད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་བཞུགས་པ་ན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ལྷ་མ་ཡིན་དང་།
en: They are (1) the seat of the universal monarch; (2) the seat of Śakra; (3) the seat of Brahmā; (4) the seat of Prajāpati; (5) the seat upon which a long succession of thus-gone ones have taught; (6) the lion throne upon which the empowered bodhisattva great being takes the seat of awakening, having gone before the Bodhi tree; (7) the unsurpassable seat of a buddha who has realized omniscient wisdom; (8) the unsurpassable wheel-turning throne upon which the wheel of Dharma is turned; (9) the lion throne of unsurpassable miracles, constructed by ten billion gods when a thus-gone one displays miracles, that transcends and outshines all worlds; and (10) the final seat of a thus-gone one, upon which, at the time of passing into parinirvāṇa, a thus-gone, worthy, and completely perfect buddha, having fully pacified all formations, sits in vajra-like absorption and instills serene confidence in gods, nāgas, yakṣas, gandharvas, kinnaras, mahoragas, asuras, garuḍas, humans, and nonhumans.

source: ནམ་མཁའ་ལྡིང་དང་། མི་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱི་ཡིད་རབ་ཏུ་དང་བ་སྐྱེད་པར་བྱེད་པ་དེ་བཞིན་གཤེགས་པའི་ཐ་མའི་ཁྲི་སྟན་འདི་འཐོབ་པར་འགྱུར་བ་སྟེ། ཀུན་དགའ་བོ་སེང་གེའི་ཁྲི་སྟན་བཅུ་པོ་དེ་དག་འཐོབ་པར་ཤེས་པར་བྱའོ། །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པའམ། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ཞི་བ་བཤད་པ་ལུང་བསྟན་པ་འདི་འཆད་པ་ན།
en: “Ānanda, know that they will assume those ten lion thrones.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས་ཆོས་སྨྲ་བ་ལ་སེམས་དང་བས་གུས་པར་བྱས་ཏེ། དགའ་བ་དང་། དད་པ་དང་། གུས་པས་ཆོས་ཀྱི་སྟན་ཤོམ་པར་བྱེད་པ་དེས་ནི་སེང་གེའི་ཁྲི་སྟན་བཅུ་པོ་དེ་དག་འཐོབ་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: Ānanda, when a thus-gone one or the disciple of a thus-gone one is to expound this prophetic teaching on peace, any noble son or noble daughter who, with respect and pure intention toward the Dharma teacher, makes preparations for the teaching with joy, faith, and respect will also come to assume those ten lion thrones.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་རིགས་ཀྱི་བུ་དམིགས་མེད་ལ་ཐལ་མོ་སྦྱོར་ཅིག་དང་། དེས་ཁྱོད་ལ་དོན་དང་། ཕན་པ་དང་། བདེ་བར་འགྱུར་ཞིང་གང་གིས་ཁྱོད་མངོན་པར་ཤེས་པ་མྱུར་བ་ཉིད་དུ་འགྱུར་བའི་བསོད་ནམས་ཆེན་པོ་ཡང་ཁྱོད་ཀྱིས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: Ānanda, press your palms together in the direction of the noble son Without Reference, and it will bring you meaning, welfare, and happiness, through which you will come to have great merit and swiftly gain the higher perceptions.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་དེའི་ཚེ་རིགས་ཀྱི་བུ་དམིགས་མེད་ཀྱི་ཆོས་ཀྱི་སྟན་བཤམས་ནས་སེམས་རབ་ཏུ་དང་བས་ཞེ་ས་དང་བཅས། གུས་པ་དང་བཅས་པར་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་མེད་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །དམིགས་མེད་དཔའ་བོ་གླང་པོ་ཆེ། །དུལ་ཞིང་མཉམ་བཞག་སེམས་ཅན་ཆེ། །ཤེས་རབ་ཆེན་པོ་འོད་བྱེད་ལ། །བདག་ནི་ཐལ་མོ་སྦྱོར་བར་བགྱིད། །
en: Venerable Ānanda then arranged a Dharma seat for the noble son Without Reference, and with sincere faith, respect, and devotion, he bowed with folded hands toward the bodhisattva Without Reference and spoke these verses: “Without Reference, heroic elephant, Mighty being, gentle and imperturbable, You shine with the light of great insight; I bow to you with folded hands.

source: ཡེ་ཤེས་བརྩོན་འགྲུས་འབྱུང་བའི་གནས། །ཤེས་རབ་བརྩེགས་ཤིང་མཉམ་བཞག་པ། །མཚུངས་མེད་བརྟན་པ་འདི་ལ་ནི། །དེ་རིང་ཐལ་མོ་སྦྱར་བར་བགྱི། །
en: “Source of wisdom and diligence, Imperturbable in your massed insight, To this peerless support, I bow today with folded hands.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། དམིགས་མེད་འདི་ལ་མཆོད་པའི་ཕྱིར། །ཁྱོད་ཀྱིས་ཐལ་མོ་སྦྱར་བྱས་པའི། །རྣམ་སྨིན་ཇི་སྙེད་འཛིན་པ་དེ། །གཽ་ཏམ་བུ་ལ་བཤད་པར་བྱ། །
en: The Blessed One then said in verse to Venerable Ānanda: “Son of Gautama, I shall now tell The karmic result Of pressing your palms together In veneration for Without Reference.

source: ཀུན་དགའ་བོ་ཁྱོད་ཐལ་མོ་སྦྱར་བ་དེའི་རྣམ་པར་སྨིན་པས་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་གྲོང་དང་གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དག་ཏུ་ཉན་ཐོས་རྣམས་ལ་སྟོན་པའི་བྱ་བ་བྱེད་པར་འགྱུར་ཞིང་ཁྱོད་དེ་དང་དེ་དག་ཏུ་འཇུག་པ་དང་འབྱུང་བ་དང་འགྲེང་བ་དང་འཆག་པ་དང་ཉལ་བ་དང་འདུག་པ་དང་སྤྱོད་ལམ་ཐམས་ཅད་དུ་འཇིག་རྟེན་ན་སེམས་དང་ལྡན་པ་དང་། སེམས་མེད་པའི་འབྱུང་བ་ཐམས་ཅད་ཀྱང་ཁྱོད་ག་ལ་བ་དེ་ལོགས་སུ་འདུད་པར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། སྐྱེས་པ་དང་། བུད་མེད་དང་། ལྷའི་བུ་མོ་དང་། སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་ཆེན་པོ་དང་། ཞང་བློན་དང་། ཞང་བློན་གྱི་གཡོག་གཉུག་མ་དང་། ཚོང་དཔོན་དང་། གྲོང་མི་དང་། ལྗོངས་ཀྱི་མི་དང་། ཁྱིམ་བདག་རྣམས་དང་། གཞན་ཡང་གང་དག་མིར་གྱུར་པའི་སོ་སོའི་སྐྱེ་བོ་རྣམས་དང་།
en: “Ānanda, once I have passed into parinirvāṇa, as the karmic result of pressing your palms together, you will act as a teacher of disciples in villages, cities, and market towns, in the countryside, and in kings’ palaces, and in all your activities—whether you are entering, leaving, standing, walking, lying down, or sitting—both beings with sentience and inanimate things in this world— men and women, goddesses, carakas, parivrājakas, ascetics, brahmins, kings, ministers, royal ministers and the resident staff of royal ministers, merchants, city folk and country folk, householders, and every other type of person—will bow in your direction.

source: དེ་བཞིན་དུ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་གླང་པོ་ཆེ་དང་། རྟ་དང་། རི་དགས་དང་། ཕྱུགས་དང་། བྱ་དག་གིས་ཁྱོད་མཐོང་ན་དད་པ་འཐོབ་པར་འགྱུར་རོ། །
en: Likewise, animals of every station—elephants, horses, deer, cows, and birds—will be filled with faith upon seeing you.

source: དེ་བཞིན་དུ་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དག་དང་། མེ་ཏོག་ཡོད་པ་དག་དང་། འབྲས་བུ་ཡོད་པ་དག་ཀྱང་ཁྱོད་ག་ལ་བ་དེ་ལོགས་སུ་རབ་ཏུ་འདུད་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་ཁང་ཁྱིམ་དང་། གཞལ་མེད་ཁང་དང་།
en: And, likewise, grass and shrubs, medicinal plants, canopy trees, flowering trees, and fruit trees will bend in your direction.

source: ཁང་པ་བརྩེགས་པ་དང་། ཁང་བཟངས་དང་། པུ་ཤུ་དང་། སྐར་ཁུང་དང་། རྟ་བབས་དག་ཀྱང་ཁྱོད་ཀྱི་བསོད་ནམས་ཀྱི་གཟི་བརྗིད་ཀྱི་ཟིལ་གྱིས་ནོན་ཅིང་ཁྱོད་ག་ལ་བ་དེ་ལོགས་སུ་རབ་ཏུ་འདུད་པར་འགྱུར་ཏེ། ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་མངོན་སུམ་དུ་མཛད་དེ།
en: Likewise, even houses and towering palaces, storied mansions, and fine houses, even parapets, windows, and dismounting steps, will bow in your direction, overcome by the splendor of your merit.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་ཉེ་འཁོར་གྱི་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དང་། མེ་ཏོག་ཡོད་པ་དག་དང་། འབྲས་བུ་ཡོད་པ་དག་དང་། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། མི་དང་མི་མ་ཡིན་པའི་བར་དག་གིས་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེ་ལོགས་སུ་རབ་ཏུ་བཏུད་པར་གྱུར་ཏོ། །ཀུན་དགའ་བོ་དེ་བཞིན་དུ་ཁྱོད་ཀྱིས་ཀྱང་རིགས་ཀྱི་བུ་དམིགས་མེད་ལ་ཐལ་མོ་སྦྱར་ཅིང་ལུས་བཏུད་པའི་དགེ་བའི་རྩ་བ་འདིས་ཁྱོད་ཀྱི་སྤྱོད་ལམ་ཐམས་ཅད་དུ་མི་དང་། མི་མ་ཡིན་པ་དང་། ནགས་ཚལ་ཐམས་ཅད་ཁྱོད་ག་ལ་བ་དེ་ལོགས་སུ་འདུད་པ་དང་། རབ་ཏུ་འདུད་པ་དང་།
en: “Ānanda, just as whenever a thus-gone, worthy, completely perfect buddha attains complete liberation, free of all obscuration—when he awakens to complete, unsurpassed buddhahood—all the grass, shrubs, medicinal plants, canopy trees, flowering trees, and fruit trees in the vicinity of the seat of awakening do as has just been described, and like humans and nonhumans alike will bow in the direction of the thus-gone one, in the same way, Ānanda, because of the root of virtue of having bowed with folded hands to the noble son Without Reference, humans, nonhumans, and all types of plants will bow in your direction, wherever you are, bowing low, really bowing down.

source: མངོན་པར་རབ་ཏུ་འདུད་པར་འགྱུར་རོ། །ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའམ། ད་ལྟར་མངོན་སུམ་དུ་གྱུར་ཅིང་བཞུགས་པ་ན་ཆོས་བཀོད་པ་ལུང་སྟོན་པ་འདི་ཐོས་ནས། ལྷག་པའི་བསམ་པས་ཐལ་མོ་གཅིག་ཙམ་སྦྱོར་བར་བྱེད་པ་དང་། ངེས་པར་རྟོག་ཅིང་མོས་པར་བྱེད་པ་དེ་དག་ནི་ངས་བསྟན་པའི་རྣམ་པར་སྨིན་པ་གང་ཡིན་པ་དེ་ལྟ་བུ་དག་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: “Ānanda, any noble sons or daughters present now who have heard this teaching as the Thus-Gone One passes into parinirvāṇa, who press their palms together with sincerity and faithfully consider it certain, will fully receive karmic results like those I have just described.

source: ཀུན་དགའ་བོ་དེ་ལྟ་མོད་ཀྱི་སེམས་ཅན་གང་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པར་འགྱུར་བ་དང་། གང་དག་གིས་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་ལན་གཅིག་གམ། ལན་གཉིས་ཐོས་པར་འགྱུར་བ་དེ་དག་ཀྱང་ཉུང་ན། གང་དག་གིས་འདི་ལྟ་བུ་ཐོས་ནས་དད་པ་འཐོབ་པར་འགྱུར་བ་དང་། གང་དག་ལྷག་པའི་བསམ་པས་མོས་པར་འགྱུར་བ་དང་།
en: “Ānanda, although those beings who hear this Dharma teaching in this way or hear the sūtra even once or twice may be few, any who hear it will develop faith and sincere devotion, will consider it certain, will have correct ideas about it, and will be without hesitation, not to mention being free of doubt.

source: ངེས་པར་རྟོག་པར་འགྱུར་བ་དང་། ཡང་དག་པའི་འདུ་ཤེས་སྐྱེད་པར་འགྱུར་བ་དང་། སོམ་ཉི་མེད་པར་འགྱུར་བ་དང་། ཐེ་ཙོམ་མེད་པར་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཐམས་ཅད་ནི་ངས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་ཤིང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱིས་མཁྱེན་ཏེ།
en: I see all those noble sons and noble daughters with my awakened vision and know them with my awakened wisdom.

source: དེ་དག་གིས་ནི་སངས་རྒྱས་གཅིག་ལ་བསྙེན་བཀུར་བྱས་པ་མ་ཡིན་ཞིང་། དེ་དག་གིས་ནི་སངས་རྒྱས་གཅིག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མ་ཡིན་ཏེ།
en: They have not venerated just a single buddha, nor have they generated roots of virtue toward a single buddha.

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཐམས་ཅད་ནི་གང་དག་ད་ལྟར་ངའི་མངོན་སུམ་དུ་འཁོར་འདི་ཉིད་དུ་འདུས་ཏེ་འདུག་པ་དང་། ངའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་བལྟ་བའི་ཕྱིར་འདིར་འོངས་པ་དག་བཞིན་དུ་ཀུན་དགའ་བོ་དེ་དག་ཀྱང་དེང་ཕྱིན་ཆད་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཤེགས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དག་ལ་མཆོད་པ་དང་བསྙེན་བཀུར་ཆེན་པོ་བྱེད་པར་འགྱུར་རོ། །
en: All noble sons and noble daughters, like those actually gathered around me here and now who have come to witness my passing into parinirvāṇa, Ānanda, will also later come to the seat of awakening of the thus-gone, worthy, perfect Buddha Maitreya, and they will sincerely worship and venerate him from the time of his unsurpassed, completely perfect awakening in complete buddhahood until his passing into parinirvāṇa.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡང་མཐོང་བར་འགྱུར་རོ། །
en: So will they also witness the great parinirvāṇa of the thus-gone, worthy, perfect Buddha Maitreya.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱན་སྔར་ཁྱེའུ་བཞི་འོང་བར་འགྱུར་བ་དག་ཀྱང་མཐོང་བར་འགྱུར་ཞིང་ད་ལྟར་ངའི་སྤྱན་སྔ་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཆོས་ཀྱང་ཐོས་པར་འགྱུར་རོ། །
en: “These four boys will also come before that thus-gone one, see him, and listen to the Dharma he teaches—just as they are doing in my presence now.

source: དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ཀྱི་སྤུའི་ཁུང་བུ་དག་ནས་ཆོས་ཀྱི་སྒྲ་སྐད་རྒྱ་ཆེན་པོ་འབྱུང་བར་འགྱུར་བ་དག་ཀྱང་ཐོས་པར་འགྱུར་ཞིང་ཐོས་ནས་ཀྱང་དགའ་བ་སྐྱེ་བར་འགྱུར་རོ། །
en: At that time, too, Dharma words will resound loudly, for all to hear, from the pores of the bodhisattva great being Without Reference, to the delight of those that hear them.

source: ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་དོན་ངེས་པར་འབྱུང་བའི་མདོ་སྡེ་འདི་ལྟ་བུ་བཤད་པ་དག་ལ་ཡང་དང་ཡང་དུ་ལུས་བཏུད་དེ་ཐལ་མོ་སྦྱར་བར་བྱ་ཞིང་སེམས་ཀྱིས་དད་པ་བསྐྱེད་པར་ཡང་བྱའོ། །
en: “So Ānanda, you should bow with folded hands again and again to those who expound sūtras of definitive meaning such as this, and you should have faith.

source: ཀུན་དགའ་བོ་འདི་ལྟར་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཁྱོད་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ལེགས་པར་མཆོད་པར་འགྱུར་ཞིང་ཁྱོད་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ཡང་རབ་ཏུ་འདུད་པར་འགྱུར་ཞིང་ཁྱོད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ལུས་ལ་ཡང་ལྷ་དང་མི་རྣམས་མཆོད་པ་བྱེད་པར་འགྱུར་བའི་ཕྱིར་རོ། །
en: Because, Ānanda, as the karmic result of this, you will come to be venerated by all beings. The whole world with its gods will bow before you, and when you pass into parinirvāṇa, gods and humans alike will worship your body.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་བཀའ་སྩལ་པ། མ་འགགས་པ་ཁྱོད་ཀྱིས་ལྷ་བྱེ་བ་ཕྲག་བཞི་བཅུས་སྟེང་གི་བར་སྣང་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཐལ་མོ་སྦྱར་ཏེ་ལུས་བཏུད་ཅིང་འཁོད་པ་དག་མཐོང་ངམ།
en: The Blessed One then asked Venerable Aniruddha, “Aniruddha, did you see four hundred million gods bowing with folded hands in the midst of the sky when they heard this Dharma discourse?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །བཀའ་སྩལ་པ།
en: “Yes indeed, Blessed One.”

source: མ་འགགས་པ་དེ་དག་ནི་ཆོས་ལ་དད་པ་དང་ལྡན་པས་ཐལ་མོ་སྦྱར་ཅིང་དད་པས་ལུས་རབ་ཏུ་བཏུད་པའི་དགེ་བའི་རྩ་བ་དེས་བསྐལ་པ་གྲངས་མེད་པར་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་ཞིང་། ལྷ་དང་མིར་མཚམས་སྦྱོར་བར་འགྱུར་ལ།
en: “Aniruddha, by the roots of virtue gained by pressing their palms together with faith in the Dharma and bowing their bodies low with faith, they will not fall into bad rebirth for countless eons but will be reborn in the company of gods and humans.

source: དེ་དག་མིར་གྱུར་པ་ན་རེ་རེས་ཀྱང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བས་ལྷག་པ་སྙེད་བྱེད་པར་འགྱུར་རོ། །
en: When reborn as humans, each of them will reign as a universal monarch with domains as numerous as the grains of sand in the river Gaṅgā, and all will pay respects to the buddha who has appeared in their world.

source: ཐམས་ཅད་དུ་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པར་འགྱུར་ཞིང་དེ་དག་དེའི་འོག་ཏུ་དགེ་བའི་རྩ་བ་དག་ཡང་དག་པར་བསྒྲུབས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ་ཐམས་ཅད་ཀྱང་འདི་ལྟ་སྟེ།
en: They will then perfect the roots of virtue and fully awaken to unsurpassed and perfect awakening.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འབྱུང་བ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་གདུང་བར་འོས་པ་ཞེས་བྱ་བར་མཚན་འཐུན་པའི་དེ་བཞིན་གཤེགས་པ་ཤ་སྟག་ཏུ་འགྱུར་རོ། །ཡང་དེའི་ཚེ་གྱད་དགའ་བ་ཞེས་བྱ་བ་དང་། གྱད་རྒྱལ་དཀའ་ཞེས་བྱ་བ་དང་། གྱད་སྟོབས་པོ་ཆེ་དང་། གཟི་བརྗིད་ལྷ་དང་། རྒྱལ་བའི་ལྷ་དང་། ཕྲག་པར་འཛེག་དང་། བློ་བཟང་དང་།
en: All will be thus: they will be none other than thus-gone ones, fit to be called by the name Worthy of Bowing by all thus-gone, worthy, perfectly buddhas that appear.”

source: འཇིགས་མེད་དང་། དབྱིག་དང་། བདེན་པ་དང་། བྱང་ཕྱོགས་ཀྱི་སྟོབས་ཀྱི་མིག་དང་། གྱད་ཐམས་ཅད་བཟོད་ཅེས་བྱ་བ་དེ་དག་ཐམས་ཅད་འཁོར་ལྔ་བརྒྱ་ཙམ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ་འདུག་པར་གྱུར་ནས།
en: At this time, the Malla called Joyful, the Malla called Invincible, the Mallas Mighty, Resplendent, Victorious God, Ascending on Shoulders, Intelligent, Fearless, Riches, Truth, and Mighty Eye of the North, and the Malla called All-Enduring, with an entourage of about five hundred, joined those assembled and worshiped the Thus-Gone One.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་ལུས་ཐུར་དུ་བཏུད་ནས་ངུ་བར་བྱེད། སྨྲེ་སྔགས་འདོན་པར་བྱེད་ཅིང་མིག་མཆི་མས་གང་བཞིན་དུ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They bowed with folded hands toward the Blessed One and wept.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བགྱིད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དམིགས་མེད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་འདི་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཆེན་པོའི་དགེ་འདུན་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡང་མཆོད་པ་བགྱི་བའི་སླད་དུ་ཐལ་མོ་སྦྱོར་ཞིང་ལུས་ཀྱང་རབ་ཏུ་འདུད་པར་བགྱིད་ལགས་སོ། །
en: Lamenting, their eyes full of tears, they supplicated the Blessed One: “Blessed One, to venerate the Blessed One, the bodhisattva Without Reference, the assembled bodhisattvas, the great saṅgha of the Blessed One’s great disciples, and this Dharma teaching, we bow with folded hands.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གི་དགེ་བའི་རྩ་བ་འདི་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ། །
en: Blessed One, we dedicate all our roots of virtue to the attainment of unsurpassed, completely perfect awakening.”
